<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 3 to add, 0 to change, 0 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_service.storage will be created
  + resource "google_project_service" "storage" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "dungeon-studio-genshin-dev"
      + service            = "storage.googleapis.com"
    }

  # google_storage_bucket.web will be created
  + resource "google_storage_bucket" "web" {
      + effective_labels            = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + location                    = "EU"
      + name                        = "develop.genshin.dungeon.studio"
      + project                     = "dungeon-studio-genshin-dev"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "index.html"
        }
    }

  # google_storage_bucket_iam_binding.public_read will be created
  + resource "google_storage_bucket_iam_binding" "public_read" {
      + bucket  = "develop.genshin.dungeon.studio"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "allUsers",
        ]
      + role    = "roles/storage.objectViewer"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web_bucket_name = "develop.genshin.dungeon.studio"

```
</details>